## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/7355362587)



<pre><code>Error: Error creating Service: googleapi: Error 409: Resource &#39;security-dashboard-token&#39; already exists.

  with module.security_dashboard_token.google_cloud_run_service.security_dashboard_token,
  on ../../modules/security-dashboard-token/security-dashboard-token.tf line 18, in resource &#34;google_cloud_run_service&#34; &#34;security_dashboard_token&#34;:
  18: resource &#34;google_cloud_run_service&#34; &#34;security_dashboard_token&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.kubectl_file_documents.automated_approver: Reading...
data.kubectl_file_documents.automated_approver_rules: Reading...
data.kubectl_file_documents.automated_approver: Read complete after 0s [id=1e30e533aeaf744fa6c77b8d106e6c97a30352edf9730ef707acbae0997e7dce]
data.kubectl_file_documents.automated_approver_rules: Read complete after 0s [id=19c34a2d52f016db7760167874f1dd600c43fd4c3393fc0e1a46bc2398211be8]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.service_account_keys_rotator.data.google_project.project: Reading...
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_project.project: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.service_account_keys_cleaner.data.google_project.project: Reading...
data.google_client_config.gcp: Reading...
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.data.google_project.project: Reading...
module.cors_proxy.data.google_project.project: Reading...
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_client_config.gcp: Read complete after 1s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
data.google_container_cluster.prow_k8s_cluster: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 1s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
module.github_webhook_gateway.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.service_account_keys_cleaner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.cors_proxy.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.security_dashboard_token.data.google_project.project: Read complete after 2s [id=projects/sap-kyma-prow]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
data.google_container_cluster.prow_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 3s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_sa_keys_admin: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secret_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secrets_versions_manager: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionManager/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.cors_proxy.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/cors-proxy]
google_project_iam_member.service_account_keys_rotator_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.service_account_keys_cleaner_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.service_account_keys_rotator.google_cloud_run_service_iam_member.service_account_keys_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-service-account-keys-rotator]
module.service_account_keys_cleaner.google_cloud_run_service_iam_member.service_account_keys_cleaner_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-cleaner/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.writer_service_account["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
kubectl_manifest.automated_approver["/api/v1/namespaces/default/services/automated-approver"]: Refreshing state... [id=/api/v1/namespaces/default/services/automated-approver]
kubectl_manifest.automated_approver_rules["/api/v1/namespaces/default/configmaps/automated-approver-rules"]: Refreshing state... [id=/api/v1/namespaces/default/configmaps/automated-approver-rules]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=44aa64537c81299d62ff29024c54b8f8aa07889c468684a8a2094401fa341c53]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]: Refreshing state... [id=/apis/apps/v1/namespaces/default/deployments/automated-approver]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 1s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
kubernetes_network_policy.hook_to_plugins: Refreshing state... [id=default/hook-to-plugins-network-policy]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
kubernetes_network_policy.prow_allow_http_events: Refreshing state... [id=default/prow-allow-http-events]
kubernetes_network_policy.prow_cluster_default: Refreshing state... [id=default/prow-cluster-default-network-policy]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Read complete after 0s [id=ca3016e98d93149f4e3e21583163cbe5fc8b127ec3b024bfa7d08ded3ff17266]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
kubernetes_network_policy.untrusted_cluster_default: Refreshing state... [id=default/untrusted-cluster-default-network-policy]
kubernetes_cluster_role.access_signify_secrets_untrusted_workloads: Refreshing state... [id=access-signify-secrets]
kubernetes_cluster_role.access_kyma_bot_github_tokens_untrusted_workloads: Refreshing state... [id=access-kyma-bot-github-tokens]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 1s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.trusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.trusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.trusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.trusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.trusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Read complete after 0s [id=ca3016e98d93149f4e3e21583163cbe5fc8b127ec3b024bfa7d08ded3ff17266]
module.trusted_workload_gatekeeper.data.kubectl_path_d

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id               = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name             = "modules-internal"
        # (11 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.security_dashboard_token.google_cloud_run_service.security_dashboard_token will be created
  + resource "google_cloud_run_service" "security_dashboard_token" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "security-dashboard-token"
      + project                    = "sap-kyma-prow"
      + status                     = (known after apply)

      + metadata {
          + annotations           = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + effective_annotations = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + effective_labels      = (known after apply)
          + generation            = 0
          + namespace             = (known after apply)
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = (known after apply)
          + uid                   = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev/kyma-neighbors-dev-test/security-dashboard-token:0.0.2"
                  + name  = (known after apply)

                  + env {
                      + name = "CLIENT_ID"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "security-dashboard-oauth-client-id"
                            }
                        }
                    }
                  + env {
                      + name = "CLIENT_SECRET"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "security-dashboard-oauth-client-secret"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "sap-kyma-prow"
      + service     = "security-dashboard-token"
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2023-12-29T09:01:56.418428Z" -> "2023-12-29T09:05:41.879513Z"
                # (16 unchanged attributes hidden)
            }
        }
    }
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifying... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifying... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifications complete after 2s [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifications complete after 2s [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [1m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [2m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [3m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [4m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [5m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [6m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [7m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [8m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [9m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [10m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [11m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [12m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [13m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [14m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [15m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [16m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [17m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [18m50s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m0s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m10s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m20s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m30s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m40s elapsed]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Still creating... [19m50s elapsed]

Error: Error creating Service: googleapi: Error 409: Resource 'security-dashboard-token' already exists.

  with module.security_dashboard_token.google_cloud_run_service.security_dashboard_token,
  on ../../modules/security-dashboard-token/security-dashboard-token.tf line 18, in resource "google_cloud_run_service" "security_dashboard_token":
  18: resource "google_cloud_run_service" "security_dashboard_token" {


```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":9595,"Program":"tfcmt","SHA1":"72faa7b0513b90be86d1538d7f1d146ab73ce038","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->